; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image6 - mode
	infrared5 - mode
	spectrograph2 - mode
	thermograph0 - mode
	image3 - mode
	spectrograph4 - mode
	image1 - mode
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image6)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph4)
	(supports instrument1 image6)
	(supports instrument1 image3)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared5)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument4 image3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image3)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star1)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument7 infrared5)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image3)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
	(supports instrument9 infrared5)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star1)
	(supports instrument10 infrared5)
	(calibration_target instrument10 Star0)
	(supports instrument11 spectrograph4)
	(supports instrument11 thermograph0)
	(supports instrument11 image6)
	(calibration_target instrument11 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite2 Star6)
	(have_image Phenomenon5 image6)
	(have_image Phenomenon5 infrared5)
	(have_image Star6 image6)
	(have_image Phenomenon7 image3)
	(have_image Planet8 image3)
	(have_image Planet8 infrared5)
	(have_image Star9 image3)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 infrared5)
	(have_image Planet12 image1)
))

)

; plan
1. (turn_to satellite3 groundstation3 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 13
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 13
3. (calibrate satellite3 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 0 of 13
4. (turn_to satellite3 planet11 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet11)
   goals met: 0 of 13
5. (take_image satellite3 planet11 instrument7 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 1 of 13
6. (turn_to satellite3 phenomenon5 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon5)
   goals met: 1 of 13
7. (take_image satellite3 phenomenon5 instrument7 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 2 of 13
8. (turn_to satellite3 phenomenon10 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 13
9. (turn_to satellite2 star6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star6)
   goals met: 3 of 13
10. (turn_to satellite1 star0 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star0)
   goals met: 3 of 13
11. (turn_to satellite0 star0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star0)
   goals met: 3 of 13
12. (take_image satellite3 phenomenon10 instrument7 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 4 of 13
13. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 13
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 13
15. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 4 of 13
16. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 4 of 13
17. (turn_to satellite0 phenomenon5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 13
18. (take_image satellite0 phenomenon5 instrument0 image6)
   added: (have_image phenomenon5 image6)
   goals met: 5 of 13
19. (turn_to satellite0 star6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star6)
   goals met: 5 of 13
20. (take_image satellite0 star6 instrument0 image6)
   added: (have_image star6 image6)
   goals met: 6 of 13
21. (turn_to satellite1 phenomenon7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon7)
   goals met: 6 of 13
22. (take_image satellite1 phenomenon7 instrument3 image3)
   added: (have_image phenomenon7 image3)
   goals met: 7 of 13
23. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 7 of 13
24. (take_image satellite1 planet8 instrument3 image3)
   added: (have_image planet8 image3)
   goals met: 8 of 13
25. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 8 of 13
26. (take_image satellite1 star9 instrument3 image3)
   added: (have_image star9 image3)
   goals met: 9 of 13
27. (turn_to satellite1 planet12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet12)
   goals met: 10 of 13
28. (take_image satellite1 planet12 instrument3 image1)
   added: (have_image planet12 image1)
   goals met: 11 of 13
29. (turn_to satellite3 planet12 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet12)
   goals met: 11 of 13
30. (take_image satellite3 planet12 instrument7 infrared5)
   added: (have_image planet12 infrared5)
   goals met: 12 of 13
31. (turn_to satellite3 planet8 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet8)
   goals met: 12 of 13
32. (take_image satellite3 planet8 instrument7 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 13 of 13
